nothung.org
:PROPERTIES:
:ID:       4401310f-222c-4031-8bd3-886830619480
:ROAM_ALIASES: nothung
:END:
#+STARTUP: overview
#+filetags: :Emacs:
#+TITLE: ⚡My Emacs Config - Nothung

Emacsを極限まで叩き上げ, なによりも強靭な刃にする. [[https://www.youtube.com/watch?v=04L18rQiIgw][一つのことを極める]].

副題のノートォング(Nothung)とは勇者ジークフリートの持つ伝説の剣である.

- https://www.youtube.com/watch?v=B6wChr_geAg
- https://www.youtube.com/watch?v=v31N8zxGhQY

---

packageの並び順は [[https://github.com/hlissner/doom-emacs][Doom Emacs]] の [[https://github.com/hlissner/doom-emacs/blob/develop/docs/modules.org][Molule Index]] (アルファベット順)に従う.

ref: https://github.com/tsu-nera/nothung

いつも忘れるDoom Emacs Configuration記法は [[https://github.com/hlissner/doom-emacs/blob/master/docs/getting_started.org#configuring-doom][ここ]].

- use-package! は:defer, :hook, :commands, or :after が省略されると起動時に loadされる.
- after! は package が load されたときに評価される.
- add-hook! は mode 有効化のとき. setq-hook!は equivalent.

どれを使うかの正解はないがすべて use-package!だと起動が遅くなるので
場合によってカスタマイズせよ，とのこと.

ref. 過去の設定は[[https://github.com/tsu-nera/dotfiles/tree/master/.emacs.d/inits][こちら]]. 

#+begin_src emacs-lisp :tangle yes
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
(load-file "~/.doom.d/private/config.el")

;; 自作関数
(load-file "~/.doom.d/utils.el")
#+end_src

* App

** eww

Emacsのテキストブラウザ([[https://www.gnu.org/software/emacs/manual/html_mono/eww.html][Manual]])

notes:
- ewwを起動しただけだとminibufferなのでC-gで消えてしまうので大きくC-x 1とかで大きくする.
- C-u M-x ewwでひとつのbufferを使いまわすのではなく別のBufferでewwを開く.
- M-RETでURLを新しいBufferで開く.
- Doom EmacsだとC-c s o(online)でいろいろと検索できる(w/Chrome). helm-google-suggest的な.

#+begin_src emacs-lisp :tangle yes
(use-package! eww
  :bind
  ("C-c s w" . eww-search-words)
  ("C-c o w" . eww-open-in-new-buffer))
#+end_src

- ace-linkをつかうとewwのlinkをインタラクティブに選択できて便利.

#+begin_src emacs-lisp :tangle yes
(use-package! ace-link
  :config
  (eval-after-load 'eww '(define-key eww-mode-map "f" 'ace-link-eww))
  (ace-link-setup-default)
  (define-key org-mode-map (kbd "M-o") 'ace-link-org))
#+end_src

** Pocket

あとで読むサービス.

#+begin_src emacs-lisp :tangle no
(global-set-key (kbd "C-x w p") 'pocket-reader)
(use-package! pocket-reader
  :bind
  ("C-x w l" . pocker-reader-add-link)
  :config
  (setq pocket-reader-open-url-default-function #'eww)
  (setq pocket-reader-pop-to-url-default-function #'eww))
#+end_src

** RSS(Elfeed)

#+begin_src emacs-lisp :tangle no
;; elfeed
(global-set-key (kbd "C-x w w") 'elfeed)
(use-package! elfeed
  :config
  (setq elfeed-feeds
        '(
          ("https://yuchrszk.blogspot.com/feeds/posts/default" blog) ; パレオな男
          ("https://www.youtube.com/feeds/videos.xml?channel_id=UCFo4kqllbcQ4nV83WCyraiw" youtube) ; 中田敦彦
          ("https://www.youtube.com/feeds/videos.xml?channel_id=UCFdBehO71GQaIom4WfVeGSw" youtube) ;メンタリストDaiGo
          ("https://www.youtube.com/feeds/videos.xml?playlist_id=PL3N_SB4Wr_S2cGYuI02bdb4UN9XTZRNDu" youtube) ; 与沢の流儀
          ("http://www.aaronsw.com/2002/feeds/pgessays.rss" blog) ; Paul Graham
          ))
  (setq-default elfeed-search-filter "@1-week-ago +unread ")
  (defun elfeed-search-format-date (date)
    (format-time-string "%Y-%m-%d %H:%M" (seconds-to-time date)))
  )
#+end_src

** Habitica

#+begin_src emacs-lisp :tangle no
(use-package! habitica
  :commands habitica-tasks
  :init
  (bind-key "C-x t g" 'habitica-tasks)
  :config
  (setq habitica-show-streak t)
  (setq habitica-turn-on-highlighting nil))
#+end_src

** Twitter

もうメンテされてない. 

#+begin_src emacs-lisp :tangle no
;; App
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; twittering-mode
;; この設定がないと認証が失敗した.
;; twittering-oauth-get-access-token: Failed to retrieve a request token
(use-package! twittering-mode
  :init
  (setq twittering-allow-insecure-server-cert t))
#+end_src

** Tidalcycles

音楽

https://tidalcycles.org/docs/getting-started/editor/Emacs

#+begin_src emacs-lisp :tangle no
(use-package! tidal
  ;; :init
  ;; (setq tidal-boot-script-path "~/.cabal/share/x86_64-osx-ghc-8.8.4/tidal-1.7.4/BootTidal.hs")
  )
#+end_src

* Checkers

#+begin_src emacs-lisp :tangle yes
;; Checkers
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

#+end_src

* Completion

** company-mode

#+begin_src emacs-lisp :tangle yes
;; Completion
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; org-roam の completion-at-point が動作しないのはこいつかな...
;; (add-hook! 'org-mode-hook (company-mode -1))
;; company はなにげに使いそうだからな，TAB でのみ補完発動させるか.
(setq company-idle-delay nil)
(global-set-key (kbd "TAB") #'company-indent-or-complete-common)
#+end_src

** avy/swiper

検索強化. 

#+begin_src emacs-lisp :tangle yes
(use-package! avy
  :bind
  ("C-x ," . avy-goto-char) ;; doom の keybind 上書き.
  ("C-c g l" . avy-goto-line) ;; doom の keybind 上書き.
  ("C-c s c". avy-goto-word-1))
(global-set-key (kbd "C-c g L") 'consult-goto-line)

;; うまく動かないので封印 doom との相性が悪いのかも.
;; ひとまず migemo したいときは isearch で対応.
;; (use-package! avy-migemo
;;  :after migemo
;;  :bind
;;  ("M-g m m" . avy-migemo-mode)
;;  ("M-g c" . avy-migemo-goto-char-timer) ;; doom の keybind 上書き.
;;  :config
;;  (avy-migemo-mode 1)
;;  (setq avy-timeout-seconds nil))

;; Vertico使用のためswiperとivyは無効化
;; (use-package! swiper
;;   :config
;;   (ivy-mode 1))


  
;; avy-migemo-e.g.swiper だけバクる
;; https://github.com/abo-abo/swiper/issues/2249
;;(after! avy-migemo
;;  (require 'avy-migemo-e.g.swiper))
#+end_src

** affe

fuzzy find. あいまい検索 for consult.

https://github.com/minad/affe

#+begin_src emacs-lisp :tangle yes
(use-package! affe
  :after consult
  :config
  (defun affe-orderless-regexp-compiler (input _type)
    (setq input (orderless-pattern-compiler input))
    (cons input (lambda (str) (orderless--highlight input str))))
  (setq affe-regexp-compiler #'affe-orderless-regexp-compiler))
#+end_src

** all-the-icons-completion

https://github.com/iyefrat/all-the-icons-completion

#+begin_src emacs-lisp :tangle no
(use-package! all-the-icons-completion
  :init
  (all-the-icons-completion-mode))
(add-hook! marginalia-mode-hook #'all-the-icons-completion-marginalia-setup)
#+end_src

** Copilot.el

https://github.com/copilot-emacs/copilot.el

Strongly recommend to enable childframe option in company module ((company +childframe)) to prevent overlay conflict.

#+begin_src emacs-lisp :tangle no
;; accept completion from copilot and fallback to company
(use-package! copilot
  :hook (prog-mode . copilot-mode)
  :bind (:map copilot-completion-map
              ("<tab>" . 'copilot-accept-completion)
              ("TAB" . 'copilot-accept-completion)
              ("C-TAB" . 'copilot-accept-completion-by-word)
              ("C-<tab>" . 'copilot-accept-completion-by-word)))
#+end_src

* Config

#+begin_src emacs-lisp :tangle yes
;; Config
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; doom specific config
;; (setq user-full-name "John Doe"
;;      user-mail-address "john@doe.com")
(setq confirm-kill-emacs nil) ; 終了時の確認はしない.

;; フルスクリーンで Emacs 起動
;; ブラウザと並べて表示することが多くなったのでいったんマスク
;; (add-to-list 'initial-frame-alist '(fullscreen . maximized))

;; This is to use pdf-tools instead of doc-viewer
(use-package! pdf-tools
  :config
  (pdf-tools-install)
  ;; This means that pdfs are fitted to width by default when you open them
  (setq-default pdf-view-display-size 'fit-width)
  :custom
  (pdf-annot-activate-created-annotations t "automatically annotate highlights"))

;; projectileの検索スピードを上げる
(setq projectile-indexing-method 'alien)

;; グローバルに有効化
(global-auto-revert-mode 1)

;; custom-fileの設定
(setq custom-file (expand-file-name "custom.el" doom-user-dir))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src

* Editor
#+begin_src emacs-lisp :tangle yes
;; Editor
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; 英数字と日本語の間にスペースをいれる.
;;(use-package! pangu-spacing
;;  :config
;;  (global-pangu-spacing-mode 1)
  ;; 保存時に自動的にスペースを入れるのを抑止.あくまで入力時にしておく.
;;  (setq pangu-spacing-real-insert-separtor nil))

;; 記号の前後にスペースを入れる.
(use-package! electric-operator)
(add-hook! 'org-mode-hook #'electric-operator-mode)
#+end_src

** cua-mode

#+begin_src emacs-lisp :tangle yes
(cua-mode t)
(setq cua-enable-cua-keys nil) 
#+end_src

** 改行(newline)と折り返し(wrap)

まず改行(newline)と折り返し(wrap)の２つの概念があることに注意. 

方針として自動改行は無効, 自動折り返しは許す. 

auto-fill-modeで自動改行される. これは無効にする. 

追記: 方針変更. コードではauto-fillを許す. そして単に(auto-fill-mode -1)をところでmodeのhookによって再度有効になる気がする. 

#+Begin_src emacs-lisp :tangle yes
;; (auto-fill-mode -1)
#+end_src

問題はMarkdownやOrg-modeでautl-fillが発動して改行されるところ. org-modeで再度hookが走り有効になる気がするのでコレで息を止める. 

->息が止まらないので諦めた. いくら無効にしてもorg-mode-hookの延長でauto-fill-modeをonにしてしまう人がいる. そしてその犯人が誰か２時間追求しても結局わからない. Doom Emacsの設定の仕業はある. 

#+begin_src emacs-lisp :tangle yes
(auto-fill-mode -1)
(remove-hook 'org-mode-hook #'auto-fill-mode)
;; (remove-hook 'org-mode-hook #'turn-on-auto-fill)
;; (remove-hook 'text-mode-hook #'auto-fill-mode)
;; (remove-hook 'text-mode-hook #'turn-on-auto-fill)
;; (add-hook 'org-mode-hook #'turn-off-auto-fill)
;; (add-hook 'text-mode-hook #'turn-off-auto-fill)
;; (add-hook 'org-roam-mode-hook #'turn-off-auto-fill)
#+end_src

これによって折り返しの限界を80から99999にすることにして回避する. 

#+begin_src emacs-lisp :tangle yes
(setq-default fill-column 99999)
(setq fill-column 99999)
#+end_src

これにより折り返しで / や $ 記号が表示される. 以下の設定で消す. 

#+begin_src emacs-lisp :tangle yes
;; / を削除
(set-display-table-slot standard-display-table 'wrap ?\ )
;; $ を削除
(set-display-table-slot standard-display-table 0 ?\ )
#+end_src

さらに折り返しの次のラインにインデントが挿入される. これはelectric-indent-modeの仕業. 現在org-modeのみで無効中. 

折り返しoff/onは, M-x toggle-truncate-linesで切り替えることができる. 

** visual-line-mode

単語単位での折り返しをするEmacs標準実装のモード. 

Emacsはウィンドウの右端の近くの単語の境界で折り返すよう試みる. これは単語の途中で折り返さないことにより可読性を高めるため. 

https://ayatakesi.github.io/emacs/25.1/Visual-Line-Mode.html

この設定はスクリーンの幅によって判定されるためたとえば文字列80で折り返すとかではない. 

日本語と英語が入り交じるときの解釈が変なので以下を設定した. 

#+begin_src emacs-lisp :tangle yes
(setq word-wrap-by-category t)
#+end_src

ref: [[https://www.reddit.com/r/emacs/comments/ov2s2r/wordwrap_problem_with_chinese_or_japanese/h76ipjy/][Word-wrap problem with Chinese or Japanese characters : emacs]]

** visual-fill-column

Doomだといらないかもだけど. 

#+begin_src emacs-lisp :tangle yes
;; (add-hook! visual-line-mode 'visual-fill-column-mode)
#+end_src

-> perfect-marginとの相性が悪い気がするのでいったん無効. 

- ref.
  -  [[http://sleepboy-zzz.blogspot.com/2015/12/emacs-visual-fill-columnel_29.html][memo: Emacs の visual-fill-column.el が便利だった]]

** perfect-margin

いい感じにmarginをとってくれる (https://github.com/mpwang/perfect-margin)

#+begin_src emacs-lisp :tangle yes
(use-package! perfect-margin
  :config
  (perfect-margin-mode t)
  ;; disable special window
  (setq perfect-margin-ignore-regexps '("*vterm*"))
  (setq perfect-margin-ignore-filters nil)  ;; disable minibuffer
)
#+end_src

** ターミナルの縦分割線をUTF-8できれいに描く

ref: [[https://www.reddit.com/r/emacs/comments/3u0d0u/how_do_i_make_the_vertical_window_divider_more/][How do I make the vertical window divider more pretty? : emacs]]

#+begin_src emacs-lisp :tangle yes
(unless (display-graphic-p)
  ;; ターミナルの縦分割線をUTF-8できれいに描く
  (defun my-change-window-divider ()
    (interactive)
    (let ((display-table (or buffer-display-table
           standard-display-table
           (make-display-table))))
      (set-display-table-slot display-table 5 ?│)
      (set-window-display-table (selected-window) display-table)))
  (add-hook 'window-configuration-change-hook 'my-change-window-divider))
#+end_src

