nothung.org
** whitespace

余分な空白/タブに色づけ.

#+begin_src emacs-lisp :tangle yes
(use-package! whitespace
  :config
  ;; limit lie length -> display-fill-column-indicator-modeを使うためマスク. 
  ;; (setq whitespace-line-column 80) 
  (setq whitespace-style '(face 
                           ;;lines-tail
                           ))
  ;; 全角スペースを可視化
  (setq whitespace-space-regexp "\\(\u3000+\\)")
  (global-whitespace-mode 1))
#+end_src

** display-fill-column-indicator-mode

Emacsの画面に1行80文字のところに線を薄く引く.

プログラミングの世界では昔から80 columns ruleがあり, Emacsで80文字目を表示する機能もいろいろあったものの, Emacs 27.0.90からdefault機能として提供されるようになった.

(最も80(charは昔の話で, 最近のディスプレイの大きさだと100charがいいという議論もある).

今つかっているモニタで縦に３分割すると74がちょうどいいことがわかった. (先頭に行番号表示4char+1charのmarginあり). 

#+begin_src emacs-lisp :tangle yes
(setq-default display-fill-column-indicator-column 78)
(global-display-fill-column-indicator-mode)
#+end_src

** iedit

複数同時編集. 

なおDoom Emacsだと +company/completeとC-;のkeybind競合.

#+begin_src emacs-lisp :tangle yes
(use-package! iedit
  :bind
  ("C-;" . iedit-mode))
#+end_src

** bm

現在行のブックマークライブラリ. 

[[https://github.com/joodland/bm][GitHub - joodland/bm: bm.el -- Visual Bookmarks for GNU Emacs]]

しかし別用途とした現在行をハイライトしてログ解析とかでつかう. 

#+begin_src emacs-lisp :tangle yes
(use-package! bm
  :bind   (("<f5>" . bm-toggle))
  :config
  (setq temporary-bookmark-p t)
  (setq bm-face '((t (:background "steel blue" :foreground "#272822")))))
;;(setq bm-face '((t (:background "#525252" :foreground ""))))
;;	   ("<C-f5>"  . bm-next)
;;	   ("<S-f5>" . bm-previous))
#+end_src

** atomic-chrome

#+begin_src emacs-lisp :tangle yes
(use-package! atomic-chrome
  ;; auto generated by gpt4
  ;; :init
  ;; (setq atomic-chrome-default-major-mode 'markdown-mode
  ;;       atomic-chrome-buffer-open-style 'frame
  ;;       atomic-chrome-url-major-mode-alist
  ;;       '(("github\\.com" . gfm-mode)
  ;;         ("redmine\\." . textile-mode)))
  :config
  (setq atomic-chrome-buffer-open-style 'full)
  (atomic-chrome-start-server))
#+end_src

* Emacs

#+begin_src emacs-lisp :tangle yes
;; Emacs
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; Emacs29
(pixel-scroll-precision-mode)

;; doomだとhelpが割り当てられていたがdoomのhelpはF1をつかう.

(global-set-key (kbd "C-h") 'backward-delete-char)
(global-set-key (kbd "C-c h r") 'doom/reload)

;; Emacs起動時にいちいち質問されるのはうざい.
;; default tではなぜか無視できないので:allを設定しておく.
(setq enable-local-variables :all)

;;; 右から左に読む言語に対応させないことで描画高速化
(setq-default bidi-display-reordering nil)
#+end_src

** Copy file path with line

ファイルパスと行番号をコピーする。Claude Codeでのコード参照形式（file_path:line_number）に対応。

- +default/yank-buffer-path

#+begin_src emacs-lisp :tangle yes
(defun my/copy-file-path-with-line ()
  "Copy the current buffer's file path with line number."
  (interactive)
  (let ((path-with-line
         (concat (buffer-file-name) ":" (number-to-string (line-number-at-pos)))))
    (kill-new path-with-line)
    (message "%s" path-with-line)))

(map! :leader
      :desc "Copy file path with line"
      "f Y" #'my/copy-file-path-with-line)
#+end_src

** recentf

けっこうrecentfでハングすることが多いので少なくする. 

#+begin_src emacs-lisp :tangle yes
;; recentfに保存する数. 
(setq recentf-max-saved-items 300)
#+end_src

** Emacs ガーベジコレクション

ガーベジコレクションでEmacsのつかうメモリを最適化する. 

ガーベジコレクションが走る間隔が多ければ途中で重くなるが, 低スペックPCだとガーベジコレクションをこまめに走らせることで全体的に軽くすることも. 要調整. 

#+begin_src emacs-lisp :tangle yes
;; GCを減らして軽くする.
;; (setq gc-cons-threshold (* gc-cons-threshold 10))
;; GCの上限閾値をあえて下げる(低スペックPC)
;; (setq gc-cons-threshold (/ gc-cons-threshold 10))

;; どうもDoom だとデフォルトで大きな値が設定されている模様なので戻す. 
;; (setq gc-cons-percentage 0.1)
;; (setq gc-cons-threshold 800000)
;; GC実行のメッセージを出す
(setq garbage-collection-messages nil)
#+end_src

** ace-window

3つ以上のwindowの選択が番号でできる. defaultでC-x oを上書きしてる? C-u C-x o だとwindowをswapできる(ace-swap-window).

** undo-tree

ビジュアライズされたundoを提供. 

C-x uでvisualizerのバッファを開く. qで終了. 

** Helpful

Emacsの*Help Bufferを強化する. 

https://github.com/Wilfred/helpful

#+begin_src emacs-lisp :tangle no
(use-package! helpful
  :config
  (global-set-key (kbd "C-c C-d") #'helpful-at-point))
#+end_src

* Email
#+begin_src emacs-lisp :tangle yes
;; Email
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

#+end_src

* Input

#+begin_src emacs-lisp :tangle yes
;; Input
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(set-language-environment "Japanese")
(prefer-coding-system 'utf-8)
(set-default 'buffer-filecoding-system 'utf-8)

;; migemo
(use-package! migemo
  :config
  (setq migemo-command "cmigemo")
  (setq migemo-options '("-q" "--emacs" "-i" "\a"))
  (setq migemo-dictionary "/usr/share/migemo/utf-8/migemo-dict")
  (setq migemo-user-dictionary nil)
  (setq migemo-regex-dictionary nil)
  (setq migemo-coding-system 'utf-8-unix)
  (migemo-init))
#+end_src

** fcitx

aggressive-setupでのminibuffer でのfcitx自動disableはよい. 相性が悪いのか, しばしば日本語入力とminibufferでEmacsがハングするので. 

#+begin_src emacs-lisp :tangle yes
(use-package! fcitx
  :config
  (setq fcitx-remote-command "fcitx5-remote")
  (fcitx-aggressive-setup)
  ;; Linux なら t が推奨されるものの、fcitx5 には未対応なためここは nil
  (setq fcitx-use-dbus nil))
#+end_src

** artist mode

[[https://www.emacswiki.org/emacs/ArtistMode][EmacsWiki: Artist Mode]]

Emacs上でカーソルやマウスを使って線が書ける.

- M-x artist-modeで起動. 
- C-c C-c で終了.
- defaultでは *.* を描写, Shiftで *-* になる.

昔なんちゃってelispを書いたけど, なんだdefaultであったのか.

ref: [[https://futurismo.biz/archives/1972/][秀丸のような罫線マクロないかなと思ってelisp作成した | Futurismo]]

* Lang

編集補助の中でも特にコーディング支援をまとめる.

** Generals

言語に依存しないコーディング支援ツール. 

*** smartparens

https://github.com/Fuco1/smartparens

Emacsでカッコの対応を取りつつ編集をするminor-mode. pareditを新しくrewriteした.

refs:

- https://ebzzry.com/en/emacs-pairs/
- http://kimi.im/2021-11-27-sexp-operations-in-emacs

[[https://github.com/hlissner/doom-emacs/blob/master/modules/config/default/%2Bemacs-bindings.el][doom emacsのsmartparens定義]]. +bindings +smartparensで有効.

#+begin_src emacs-lisp :tangle no
;;; smartparens
(:after smartparens
  :map smartparens-mode-map
  "C-M-a"           #'sp-beginning-of-sexp
  "C-M-e"           #'sp-end-of-sexp
  "C-M-f"           #'sp-forward-sexp
  "C-M-b"           #'sp-backward-sexp
  "C-M-n"           #'sp-next-sexp
  "C-M-p"           #'sp-previous-sexp
  "C-M-u"           #'sp-up-sexp
  "C-M-d"           #'sp-down-sexp
  "C-M-k"           #'sp-kill-sexp
  "C-M-t"           #'sp-transpose-sexp
  "C-M-<backspace>" #'sp-splice-sexp)
#+end_src

足りないのは自分で定義する必要あり. というかいろいろ再定義するか...

#+begin_src emacs-lisp :tangle yes
(use-package! smartparens-config
  :bind
  ("C-<right>" . sp-forward-slurp-sexp)
  ("M-<right>" . sp-forward-barf-sexp)
  ("C-<left>"  . sp-backward-slurp-sexp)
  ("M-<left>"  . sp-backward-barf-sexp)
  ("C-M-w" . sp-copy-sexp)
  ("M-[" . sp-backward-unwrap-sexp)
  ("M-]" . sp-unwrap-sexp)
  :config
  ;; copilot.elをいれたら相性が悪くなった.. 
  ;; (add-hook! 'clojure-mode-hook 'smartparens-strict-mode)
  (setq smartparens-strict-mode nil))

#+end_src

*** symbol-overlay

シンボルのハイライトをキー入力で制御できる.

https://github.com/wolray/symbol-overlay/

使ってないし companyとkeybindがかぶったのでいったん封印.

#+begin_src emacs-lisp :tangle no
(use-package! symbol-overlay
  :config
  (global-set-key (kbd "M-i") 'symbol-overlay-put)
  (global-set-key (kbd "M-n") 'symbol-overlay-switch-forward)
  (global-set-key (kbd "M-p") 'symbol-overlay-switch-backward)
  (global-set-key (kbd "<f7>") 'symbol-overlay-mode)
  (global-set-key (kbd "<f8>") 'symbol-overlay-remove-all))
#+end_src

*** codic

よい変数名を教えてくれるwebサービスcodicクライアント. 

[[https://codic.jp/][codic - プログラマーのためのネーミング辞書]]

- M-x codic: 英語 => 日本語
- M-x codic-translate => 日本語 => 英語(要token)

codic-translateを使うにはtokenを codic-api-tokenに設定する必要がある. 
現状は"private/config.el"に書いて読み込んでいる. 

#+begin_src emacs-lisp :tangle yes
(use-package! codic)
#+end_src

- [[https://github.com/emacsorphanage/codic][codic - GitHub]]
- [[https://futurismo.biz/archives/2538/][英語力を向上させたいのでまずは Emacs からはじめた | Futurismo]]

** Clojure

ref: [[https://github.com/hlissner/doom-emacs/blob/develop/modules/lang/clojure/README.org][doom-emacs/README.org - GitHub]]

とりあえず，doomのclojureモジュール有効.

+ cider
+ clj-refactor
+ flycheck-clj-kondo

その他，

+ rainbow-delimiters, smartparensはdoomのcoreパッケージとしてすでにはいっている.
+ pereditはciderの中に入っている.

#+begin_src emacs-lisp :tangle yes
;; やりすぎindent mode
(add-hook! 'clojure-mode-hook 'aggressive-indent-mode)
;; 自動でalign整形.
(setq clojure-align-forms-automatically t)

(use-package! cider
  :bind
  ;; desing journal用にbinding追加
  ("C-c C-v C-p" . cider-pprint-eval-defun-to-comment)
  ("C-c C-v M-p" . cider-pprint-eval-last-sexp-to-comment)
  :config
  ;; connectとともにREPL bufferを表示.
  (setq  cider-repl-pop-to-buffer-on-connect t)
  ;; replに 出力しすぎてEmacsがハングするのを防ぐ.
  ;; 基本的にREPLへのprintは非効率なので cider inspect推奨. 
  ;; https://github.com/practicalli/spacemacs.d/issues/4
  (setq  cider-repl-buffer-size-limit 50)


  ;; companyでのあいまい補完.
  (add-hook 'cider-repl-mode-hook #'cider-company-enable-fuzzy-completion)
  (add-hook 'cider-mode-hook #'cider-company-enable-fuzzy-completion)

  ;; うまくうごかないな.. 
  (setq cider-special-mode-truncate-lines nil)
  ;; (add-hook 'cider-stacktrace-mode-hook (lambda () (setq truncate-lines nil)))
  ;; (add-hook 'cider-inspector-mode-hook (lambda () (setq truncate-lines nil)))

  ;; stack-frame表示をプロジェクトに限定
  (setq cider-stacktrace-default-filters '(project))

  ;; cider-connectで固定portを選択候補に表示.
  ;; 固定port自体は tools.depsからのnrepl起動時optionで指定.
  (setq cider-known-endpoints '(("kotori" "0.0.0.0" "34331")))
)
#+end_src

*** clj-refactor

Emacs CIDERでClojureを書くための便利なファクタツール提供.

https://github.com/clojure-emacs/clj-refactor.el

#+begin_src emacs-lisp :tangle yes
(add-hook! clojure-mode
  (clj-refactor-mode 1)
  (yas-minor-mode 1) ; for adding require/use/import statements
  ;; This choice of keybinding leaves cider-macroexpand-1 unbound
  (cljr-add-keybindings-with-prefix "C-c C-m")

  ;; cljr-rename-symbolでのプロンプト抑止. 
  ;; どうも初回実行が遅く２回目からは問題ない. 
  (setq cljr-warn-on-eval nil)
)
#+end_src

- cljr-clean-ns
  - namespaceを整理, cljr-project-cleanでプロジェクト全体に適用.
- cljr-rename-symbol 
  - シンボル(関数名や変数名含む). 
  - どうも遅いのてLSPのほうがここはいいのかも. 

*** cljstyle: formatter for Clojure

ref: [[https://qiita.com/lagenorhynque/items/a5d83b4a36a1cf1cacbe][GitHub]]

Doom Emascの editor/format moduleと連携可能.
Clojureだとdefaultが node-cljfmtなのでcljstyleを使うには設定が必要.

#+begin_src emacs-lisp :tangle yes
(add-hook! clojure-mode
  (set-formatter! 'cljstyle "cljstyle pipe" :modes '(clojure-mode))
  (add-hook 'before-save-hook 'format-all-buffer t t))
#+end_src

*** clj-kondo: linter for Clojure

ref: [[https://qiita.com/lagenorhynque/items/dd9d6a1d97cbea738bc0][GitHub]]

