nothung.org
*** portal

Data Visualization for Clojure.

ref. https://github.com/djblue/portal

#+begin_src emacs-lisp :tangle yes
(defun portal.api/open ()
  (interactive)
  (cider-nrepl-sync-request:eval
   "(require 'portal.api) (portal.api/tap) (portal.api/open)"))

(defun portal.api/clear ()
  (interactive)
  (cider-nrepl-sync-request:eval "(portal.api/clear)"))

(defun portal.api/close ()
  (interactive)
  (cider-nrepl-sync-request:eval "(portal.api/close)"))
#+end_src

*** vega-view

#+begin_src emacs-lisp :tangle no
(use-package! vega-view
 :config
 (define-key clojure-mode-map (kbd "C-c M-n v") 'vega-view))
#+end_src

*** clerk

https://github.com/nextjournal/clerk

#+begin_src emacs-lisp :tangle no
(defun clerk-show ()
  (interactive)
  (when-let
      ((filename
        (buffer-file-name)))
    (save-buffer)
    (cider-interactive-eval
     (concat "(nextjournal.clerk/show! \"" filename "\")"))))
(define-key clojure-mode-map (kbd "<M-return>") 'clerk-show)
#+end_src

** Rust

#+begin_src emacs-lisp :tangle yes
(setq exec-path (append exec-path '("~/.cargo/bin")))
#+end_src

** rest

#+begin_src emacs-lisp :tangle no
(use-package! restclient
  :mode (("\\.rest\\'" . restclient-mode)
         ("\\.restclient\\'" . restclient-mode)))
(use-package! ob-restclient
  :after org restclient
  :init
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((restclient . t))))
#+end_src


** mermaid-mode

https://github.com/abrochard/mermaid-mode

#+begin_src emacs-lisp :tangle yes
(use-package! mermaid-mode)
#+end_src

mermaid-open-browser(C-c C-o)でmermaid-jsのサイトに飛んで表示できる. 

https://mermaid-js.github.io/mermaid-live-editor

ローカルで表を生成するにはmermaid-cliのインストールが別途必要. 

* Os

#+begin_src emacs-lisp :tangle yes
;; OS
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+end_src

** EXWM

EmacsのWindow Manager.

もはやこれをつかうと世界がEmacsになりEmacs 引きこもり生活が完成する.

counsel-linux-appだと起動時にハングしてPC再起動になることが多い. Shift+Alt+&によるアプリケーション起動がいいかも. 

#+begin_src emacs-lisp :tangle yes
(use-package! exwm
  :if (not (wsl-p))
  :after counsel
  :init
  (setq counsel-linux-app-format-function
        #'counsel-linux-app-format-function-name-only)
  (map!
        :leader
        :prefix ("z" . "exwm")
        "c" #'exwm-reset
        "o" (lambda (command)
                         (interactive (list (read-shell-command "$ ")))
                         (start-process-shell-command command nil command))
        "z" #'exwm-workspace-switch
        "m" #'exwm-workspace-move-window
        "a" #'counsel-linux-app
        "s" #'counsel-search  ;; open chrome and search
        )
  (add-hook 'exwm-input--input-mode-change-hook
            'force-mode-line-update)
  (add-hook 'exwm-update-class-hook
            (lambda ()
              (exwm-workspace-rename-buffer exwm-class-name)))
  ;; どうもChromeを立ち上げるとハングするので無効にしておく.
  (winner-mode -1)

  :config
  (require 'exwm-randr)
  (setq exwm-randr-workspace-output-plist '(0 "HDMI-1"))
  (add-hook
   'exwm-randr-screen-change-hook
   (lambda ()
     (start-process-shell-command
      "xrandr" nil "xrandr --output HDMI-1 --primary --right-of eDP-1 --auto")))
  (exwm-randr-enable)

  (require 'exwm-systemtray)
  (exwm-systemtray-enable)

  ;; edit-server的な. C-c 'で編集できるのでよりbetter
  ;; 一度入力したものを再度開くと文字化けする.
  (require 'exwm-edit)
  (setq exwm-edit-split t)

  (setf epg-pinentry-mode 'loopback)
  (defun pinentry-emacs (desc prompt ok error)
    (let ((str (read-passwd
                (concat (replace-regexp-in-string
                         "%22" "\""
                         (replace-regexp-in-string
                          "%0A" "\n" desc)) prompt ": "))))
      str))

  ;; from https://github.com/ch11ng/exwm/wiki/Configuration-Example
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (fringe-mode 1)

  ;; google-chromeを起動するとmouse on menu-barがpopupしてハングする対策
  ;; https://stackoverflow.com/questions/17280845/emacs-disable-pop-up-menus-on-mouse-clicks
  (fset 'menu-bar-open nil)
  (fset 'x-menu-bar-open nil)

  ;; Turn on `display-time-mode' if you don't use an external bar.
  (setq display-time-default-load-average nil)
  (display-time-mode t)
  (display-battery-mode 1)

  (setq exwm-workspace-number 2)

  (setq exwm-input-simulation-keys
        '(([?\C-b] . [left])
          ;; Chromeページ内検索のために空ける          
          ;; ([?\C-f] . [right])
          ;; 2022.03.23 やっぱり解除. どうもC-fがスムーズな操作を阻害する.
          ;; ページ内検索はSurfingkeysというExtensionを利用(/).
          ([?\C-f] . [right])
          ([?\C-p] . [up])
          ([?\C-n] . [down])
          ([?\C-a] . [home])
          ([?\C-e] . [end])
          ([?\M-v] . [prior])
          ([?\C-v] . [next])
          ([?\C-d] . [delete])
          ([?\C-m] . [return])
          ([?\C-h] . [backspace])
          ([?\C-k] . [S-end delete])))

  (exwm-enable))
#+end_src

* Org-mode


ご存知！

- [[https://github.com/tsu-nera/dotfiles/blob/master/.emacs.d/inits/50_org-mode.org][dotfiles/50_org-mode.org at master · tsu-nera/dotfiles · GitHub]]
  - 昔の設定. すこしずつ移植したい.

** ファイルパス

ファイルパス関連の定義はまとめてここで実施.

#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-directory (file-truename "~/repo/gtd"))

  (defconst my/gtd-projects-file (concat org-directory "/home.org"))
  (defconst my/inbox-file
    (concat org-directory "/inbox/inbox.org"))
  (defconst my/daily-journal-dir
    (concat org-directory "/journals/daily"))
  (defconst my/weekly-journal-dir
    (concat org-directory "/journals/weekly"))
  (defconst my/project-journal-bakuchi
    (file-truename "~/repo/bakuchi-doc/notes/journal.org"))
  (defconst my/project-journal-deepwork
    (file-truename "~/repo/keido/notes/zk/journal_deepwork.org"))

  ;; org-captureのtargetは詳しくいろいろ設定するのでdefaultは不要.
  ;; (setq org-default-notes-file "gtd/gtd_projects.org")

  ;; 何でもかんでも agenda すると思いので厳選.
  ;; org-journalの機能でこのほかに今日のjournal fileが追加される.
  (setq org-agenda-files
        (list
         ;; my/project-journal-bakuchi
         ;; my/project-journal-deepwork
         ;; my/daily-journal-dir
         my/gtd-projects-file
         )))

(defun my/create-weekly-org-file (path)
  (expand-file-name (format "%s.org" (format-time-string "%Y-w%V")) path))
(defun my/create-daily-org-file (path)
  (expand-file-name (format "%s.org" (format-time-string "%Y-%m-%d")) path))

(defconst my/weekly-journal-dir "~/repo/keido/notes/zk")

(defconst my/weekly-private-dir "~/repo/gtd/journals/weekly")
(defconst my/daily-private-dir "~/repo/gtd/journals/daily")
#+end_src

** Basics

#+begin_src emacs-lisp :tangle yes
;; Org mode
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; スマホとの共有のため, github を clone したものを Dropbox に置いて$HOME に symlink している.
(after! org

  (setq org-return-follows-link t) ;; Enter でリンク先へジャンプ
  (setq org-use-speed-commands t)  ;; bullet にカーソルがあると高速移動
  (setq org-hide-emphasis-markers t) ;; * を消して表示.
  (setq org-pretty-entities t)

  ;; カレンダー表示を英語表記へ
  (setq system-time-locale "C") 

  ;; defaultではFootnotes
  (setq org-footnote-section "Footnotes")
  (setq org-footnote-auto-adjust t)
  (setq org-indent-indentation-per-level 1) ;; indent波浅く

  ;; M-RET の挙動の調整
  ;; t だと subtree の最終行に heading を挿入
  ;; nil だと current point に挿入
  ;; なお，C-RET だと subtree の最終行に挿入され
  ;; C-S-RET だと手前に挿入される.
  (setq org-insert-heading-respect-content nil)

  (setq org-startup-indented t)
  (setq org-indent-mode-turns-on-hiding-stars nil)

  (setq org-startup-folded 'showall) ;; 見出しの階層指定
  (setq org-startup-truncated nil) ;; 長い文は折り返す.

  ;; electric-indent は org-mode で誤作動の可能性があることのこと
  ;; たまにいきなり org-mode の tree 構造が壊れる.とりあえず設定しておく
  ;; この設定の効果が以下の記事で gif である.
  ;; https://www.philnewton.net/blog/electric-indent-with-org-mode/
  (add-hook! org-mode (electric-indent-local-mode -1)))
#+end_src

