nothung.org
*** ox-hugo

Org-modeで書いたブログ記事をHugoにあったMarkdown形式に変換する.

ブログFuturismoはOrg-modeで執筆してこれを利用してMarkdownに変換している.

#+begin_src emacs-lisp :tangle yes
(use-package! ox-hugo
  :after ox
  :bind
  ;; org-roamのexportで多様するのでC-c rのprefixをつけておく.
  ("C-c r e" . org-hugo-export-to-md)
  :config

  (setq org-hugo-auto-set-lastmod t)
  ;; なんか.dir-locals.elに書いても反映してくれないな. 
  (setq org-export-with-author nil)
  ;; org-hugo-get-idを使うように設定.
  (setq org-hugo-anchor-functions 
        '(org-hugo-get-page-or-bundle-name
          org-hugo-get-custom-id
          org-hugo-get-id
          org-hugo-get-md5
          ;; 日本語に不向きな気がする
          ;; org-hugo-get-heading-slug
          ))
  ;; WebP画像の自動コピーを有効化
  (add-to-list 'org-hugo-external-file-extensions-allowed-for-copying "webp"))
#+end_src

このox-hugoで出力されるMarkdownはどうもリスト表示でスペースが4つ入ってしまう. GitHub Favorite Markdownのようにリストでのスペース２であって欲しいものの解決方法が見つからない.

*** ox-rst

Org-modeで書いたWiki用のページをSphinxで公開するためにreST形式に変換する.

リンク形式がうまく変換できないのでけっこう強引に変換している(もう少しうまく改善したい).

#+begin_src emacs-lisp :tangle yes
(use-package! ox-rst
  :after ox)

(after! ox
  (defun my/rst-to-sphinx-link-format (text backend info)
    (when (and (org-export-derived-backend-p backend 'rst)
               (not (search "<http" text)))
      (replace-regexp-in-string
       "\\(\\.org>`_\\)" ">`"
       (concat ":doc:" text) nil nil 1)))

  (add-to-list 'org-export-filter-link-functions
               'my/rst-to-sphinx-link-format))
#+end_src

*** ox-qmd

GitHub Flavored Markdown.

標準のMarkdownの出力だと見た目が悪い. Bufferに書き出してGitHubとかにコピペするとき用にいれておく.

ref. [[https://qiita.com/0x60df/items/3cde67967e3db30d9afe][Org-modeからQiita準拠のMarkdownをexportするパッケージを作ってみました - Qiita]]

#+begin_src emacs-lisp :tangle yes
(use-package! ox-qmd)
#+end_src

ox-gfmは2017からメンテされてないのでやめとくか([[https://github.com/larstvei/ox-gfm/issues/44][ref]]).

** org-babel(ob)

Org-modeのなかでLiterature Programming.

基本操作:

- C-c C-, コードブロックの挿入テンプレート呼び出し(org-insert-structure-tempate)
- C-c C-c コード実行(org-babel-execute-src-block)
- C-c C-o コード実行結果を開く(org-babel-open-src-block-result)
- C-c ' ソースコード編集(org-edit-src-code)
  - どうもEoom Emacsだと keybindingが外れいてる.
  - C-c l '(org-edit-special)で開く.

#+begin_src emacs-lisp :tangle yes
  (after! org
    ;; https://stackoverflow.com/questions/53469017/org-mode-source-editing-indents-code-after-exiting-source-code-block-editor
    ;; インデント. default 2になっているとへんな隙間が先頭に入る.
    (setq org-edit-src-content-indentation 0)
    (setq org-src-preserve-indentation t)
    ;; TABの挙動
    (setq org-src-tab-acts-natively t)

    ;; org-babel のソースをキレイに表示.
    (setq org-src-fontify-natively t)
    (setq org-fontify-whole-heading-line t)

    ;; 評価でいちいち質問されないように.
    (setq org-confirm-babel-evaluate nil)

    ;; org-babel で 実行した言語を書く. デフォルトでは emacs-lisp だけ.
    (org-babel-do-load-languages
      'org-babel-load-languages
      '((lisp . t)
	(shell . t)
	(clojure . t)))

    ;; org-modeからclojure codeを評価.
    (define-key org-mode-map (kbd "C-c C-v e") 'cider-eval-last-sexp)
    ;; (org-defkey org-mode-map "\C-u\C-x\C-e" 'cider-eval-last-sexp)

    ;; Clojure Modeの特別対応. keybindingが上書きされるので.
    ;; (define-key clojure-mode-map (kbd "C-c C-x k") 'org-edit-src-exit)
    ;; (define-key clojure-mode-map (kbd "C-c C-x q") 'org-edit-src-abort)
    )
#+end_src

refs:

- [[https://orgmode.org/manual/Key-bindings-and-Useful-Functions.html][org-babel Key bindings and Useful Functions (The Org Manual)]]
- [[https://misohena.jp/blog/2017-10-26-how-to-use-code-block-of-emacs-org-mode.html][org-modeのコードブロック(Babel)の使い方 | Misohena Blog]]

*** ob-html

[[https://misohena.jp/blog/2021-08-03-execute-html-in-org-mode-code-blocks.html][org-modeのコードブロックでHTMLを「実行」する | Misohena Blog]]

#+begin_src emacs-lisp :tangle yes
(use-package! ob-html
  :after org
  :config
  ;; C-c C-o でブラウザで開く.
  (org-babel-html-enable-open-src-block-result-temporary))
#+end_src

** org-superstar

org-superstar-mode(+pretty option)関連.

bulletをおしゃれにかえる. ただそれと引き換えにパフォーマンスはちょっと落ちるかも.

#+begin_src emacs-lisp :tangle no
(after! org
;;; Titles and Sections
;; hide #+TITLE:
;; (setq org-hidden-keywords '(title))
;; set basic title font
;; (set-face-attribute 'org-level-8 nil :weight 'bold :inherit 'default)
;; Low levels are unimportant => no scaling
;; (set-face-attribute 'org-level-7 nil :inherit 'org-level-8)
;; (set-face-attribute 'org-level-6 nil :inherit 'org-level-8)
;; (set-face-attribute 'org-level-5 nil :inherit 'org-level-8)
;; (set-face-attribute 'org-level-4 nil :inherit 'org-level-8)
;; Top ones get scaled the same as in LaTeX (\large, \Large, \LARGE)
;; (set-face-attribute 'org-level-3 nil :inherit 'org-level-8 :height 1.2) ;\large
;; (set-face-attribute 'org-level-2 nil :inherit 'org-level-8 :height 1.44) ;\Large
;; (set-face-attribute 'org-level-1 nil :inherit 'org-level-8 :height 1.728) ;\LARGE
;; Only use the first 4 styles and do not cycle.
(setq org-cycle-level-faces nil)

;; orgの階層の色分けレベル.
;; (setq org-n-level-faces 8)

;; Document Title, (\huge)
;; (set-face-attribute 'org-document-title nil
;;                    :height 2.074
;;                    :foreground 'unspecified
;;                    :inherit 'org-level-8)

;; (with-eval-after-load 'org-superstar
;;  (set-face-attribute 'org-superstar-item nil :height 1.2)
;;  (set-face-attribute 'org-superstar-header-bullet nil :height 1.2)
;;  (set-face-attribute 'org-superstar-leading nil :height 1.3))
;; Set different bullets, with one getting a terminal fallback.
(setq org-superstar-headline-bullets-list '("■" "◆" "●" "▷"))
;; (setq org-superstar-special-todo-items t)

;; Stop cycling bullets to emphasize hierarchy of headlines.
(setq org-superstar-cycle-headline-bullets nil)
;; Hide away leading stars on terminal.
;; (setq org-superstar-leading-fallback ?\s)
(setq inhibit-compacting-font-caches t))
#+end_src

