nothung.el

(use-package! ox-hugo
  :after ox
  :bind
  ;; org-roamのexportで多様するのでC-c rのprefixをつけておく.
  ("C-c r e" . org-hugo-export-to-md)
  :config

  (setq org-hugo-auto-set-lastmod t)
  ;; なんか.dir-locals.elに書いても反映してくれないな. 
  (setq org-export-with-author nil)
  ;; org-hugo-get-idを使うように設定.
  (setq org-hugo-anchor-functions 
        '(org-hugo-get-page-or-bundle-name
          org-hugo-get-custom-id
          org-hugo-get-id
          org-hugo-get-md5
          ;; 日本語に不向きな気がする
          ;; org-hugo-get-heading-slug
          ))
  ;; WebP画像の自動コピーを有効化
  (add-to-list 'org-hugo-external-file-extensions-allowed-for-copying "webp"))

(use-package! ox-rst
  :after ox)

(after! ox
  (defun my/rst-to-sphinx-link-format (text backend info)
    (when (and (org-export-derived-backend-p backend 'rst)
               (not (search "<http" text)))
      (replace-regexp-in-string
       "\\(\\.org>`_\\)" ">`"
       (concat ":doc:" text) nil nil 1)))

  (add-to-list 'org-export-filter-link-functions
               'my/rst-to-sphinx-link-format))

(use-package! ox-qmd)

  (after! org
    ;; https://stackoverflow.com/questions/53469017/org-mode-source-editing-indents-code-after-exiting-source-code-block-editor
    ;; インデント. default 2になっているとへんな隙間が先頭に入る.
    (setq org-edit-src-content-indentation 0)
    (setq org-src-preserve-indentation t)
    ;; TABの挙動
    (setq org-src-tab-acts-natively t)

    ;; org-babel のソースをキレイに表示.
    (setq org-src-fontify-natively t)
    (setq org-fontify-whole-heading-line t)

    ;; 評価でいちいち質問されないように.
    (setq org-confirm-babel-evaluate nil)

    ;; org-babel で 実行した言語を書く. デフォルトでは emacs-lisp だけ.
    (org-babel-do-load-languages
      'org-babel-load-languages
      '((lisp . t)
	(shell . t)
	(clojure . t)))

    ;; org-modeからclojure codeを評価.
    (define-key org-mode-map (kbd "C-c C-v e") 'cider-eval-last-sexp)
    ;; (org-defkey org-mode-map "\C-u\C-x\C-e" 'cider-eval-last-sexp)

    ;; Clojure Modeの特別対応. keybindingが上書きされるので.
    ;; (define-key clojure-mode-map (kbd "C-c C-x k") 'org-edit-src-exit)
    ;; (define-key clojure-mode-map (kbd "C-c C-x q") 'org-edit-src-abort)
    )

(use-package! ob-html
  :after org
  :config
  ;; C-c C-o でブラウザで開く.
  (org-babel-html-enable-open-src-block-result-temporary))

  ;; org-roam
