nothung.org
** org-roam

Zettelkasten MethodのOrg-roam実装.

#+begin_src emacs-lisp :tangle yes
  ;; org-roam
  (setq org-roam-directory (file-truename "~/repo/keido/notes"))
  (setq org-roam-zk-dir (concat org-roam-directory "/zk"))
  (setq org-roam-db-location (file-truename "~/repo/keido/db/org-roam.db"))

  (use-package! org-roam
    :after org
    :init
    (setq org-roam-v2-ack t)
    (map!
          :leader
          :prefix ("r" . "org-roam")
          "f" #'org-roam-node-find
          "i" #'org-roam-node-insert
          "l" #'org-roam-buffer-toggle
          "t" #'org-roam-tag-add
          "T" #'org-roam-tag-remove
          "a" #'org-roam-alias-add
          "A" #'org-roam-alias-remove
          "r" #'org-roam-ref-add
          "R" #'org-roam-ref-remove
          "o" #'org-id-get-create
          "u" #'my/org-roam-update
          "D" #'org-roam-dailies-goto-today
          )
    :custom
    ;;ファイル名を ID にする.
    (org-roam-capture-templates
     '(("z" "🌱 Zettel" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "\n#+date: %T\n#+title:🌱${title}\n#+filetags: :ZETTEL:\n")
        :unnarrowed t)
       ("w" "📝 Wiki" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:📝${title}\n#+filetags: :WIKI:\n")
        :unnarrowed t)
       ("t" "🔖 Tag" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:🔖${title}\n#+filetags: :TAG:\n")
        :unnarrowed t)
       ("h" "👨 Person" plain "%?"
        :target (file+head
                 "zk/%<%Y%m%d%H%M%S>.org"
                 "#+title:👨${title}\n#+filetags: :PERSON:\n")
        :unnarrowed t)
       ("f" "📂 Type" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:📂${title}\n#+filetags: :TYPE:\n")
        :unnarrowed t)
       ("m" "🌳 MOC" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:🌳${title}\n#+filetags: :MOC:\n")
        :unnarrowed t)
       ("i" "✅ Issue" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                          "#+title:✅${title}\n#+filetags: :ISSUE:\n")
        :unnarrowed t)
       ("d" "💡 Idea" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:💡${title}\n#+filetags: :IDEA:\n")
        :unnarrowed t)
       ("c" "📑 Concept" plain "%?"
        :target (file+head
                 "zk/%<%Y%m%d%H%M%S>.org"
                 "#+title:🎓${title}\n#+filetags: :CONCEPT:\n")
        :unnarrowed t)
       ("k" "🦊 Darkfox" plain "%?"
        :target (file+head
                 "zk/%<%Y%m%d%H%M%S>.org"
                 "#+title:🦊${title}\n#+filetags: :DARKFOX:\n")
        :unnarrowed t)
       ("b" "📚 Book" plain
        "%?

  - title: %^{title}
  - authors: %^{author}
  - date: %^{date}
  - publisher: %^{publisher}
  - url: http://www.amazon.co.jp/dp/%^{isbn}
  "
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:📚${title} - ${author}(${date})\n#+filetags: :BOOK:SOURCE:\n")
        :unnarrowed t)
       ("s" "🎙‍ Talk" plain
        "%?

  - title: %^{title}
  - url: %^{url}
  "
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:🎙 ${title} - ${editor}(${date})\n#+filetags: :TALK:SOURCE:\n")
        :unnarrowed t)
       ("o" "💻 Online" plain
        "%?

  - title: %^{title}
  - authors: %^{author}
  - url: %^{url}
  "
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:💻${title}\n#+filetags: :ONLINE:SOURCE:\n")
        :unnarrowed t)))
    (org-roam-extract-new-file-path "%<%Y%m%d%H%M%S>.org")
    ;;        :map org-mode-map
    ;;        ("C-M-i"    . completion-at-point)
    :config
    (defun my/org-roam-update ()
      (interactive)
      (org-id-update-id-locations)
      (org-roam-db-sync)
      (org-roam-update-org-id-locations))

    (setq org-roam-mode-sections
          '((org-roam-backlinks-section :unique t)))

    (setq org-roam-db-gc-threshold most-positive-fixnum)

    ;; for speed up
    ;; (setq org-roam-node-default-sort 'file-mtime)

    (setq +org-roam-open-buffer-on-find-file nil)
    ;; (org-roam-db-autosync-mode)
    (org-roam-db-autosync-enable)

    ;; (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))

    ;; for emacs 29~
    ;; (when (>= emacs-major-version 29)
    ;; (setq org-roam-database-connector 'sqlite-builtin))
  )
#+end_src

#+begin_src emacs-lisp :tangle yes
(setq org-roam-db-node-include-function
      (lambda ()
        (not (member "" (org-get-tags)))))
#+end_src

*** consult-org-roam(Org-roam検索強化)

ref. https://github.com/jgru/consult-org-roam

以下の機能を提供.ファイル名は今は日付にしているからいらないかな.全文検索は動かない.バックリンク検索だけ使えそう.

- ファイル名検索
- バックリンク検索
- 全文検索

#+begin_src emacs-lisp :tangle yes
(use-package! consult-org-roam
   :init
   (require 'consult-org-roam)
   ;; Activate the minor-mode
   (consult-org-roam-mode 1)
   :custom
   (consult-org-roam-grep-func #'consult-ripgrep)
   :config
   ;; Eventually suppress previewing for certain functions
   (consult-customize
    consult-org-roam-forward-links
    :preview-key (kbd "M-."))
   :bind
   ("C-c r F" . consult-org-roam-file-find)
   ("C-c r b" . consult-org-roam-backlinks)
   ("C-c r S" . consult-org-roam-search))
#+end_src

*** Org-roam管理下のノートの全文検索

[[https://org-roam.discourse.group/t/using-consult-ripgrep-with-org-roam-for-searching-notes/1226][Using consult-ripgrep with org-roam for searching notes - How To - Org-roam]]

consult-ripgrepを [[https://jblevins.org/projects/deft/][deft]] の代わりに使う. より高速.

検索対象が多すぎるとハングするので改善したい.

#+begin_src emacs-lisp :tangle yes
(defun my/org-roam-rg-search ()
  "Search org-roam directory using consult-ripgrep. With live-preview."
  (interactive)
  (consult-ripgrep org-roam-directory))
(global-set-key (kbd "C-c r s") 'my/org-roam-rg-search)
#+end_src

*** org-publish(Org-roamのノートをサイトへ公開)

hugo用. 現状exit abnormally で動かないので調べる.

#+begin_src emacs-lisp :tangle no
(setq org-publish-project-alist
      (list
       (list "keido-hugo"
             :recursive nil
             :base-directory org-roam-zk-dir
             :publishing-directory "~/repo/keido-hugo/content"
             :exclude ".*gitignore|.*/private/.*" 
             :publishing-function 'org-hugo-export-wim-to-md
             :with-author nil           ;; 作成者除外
             :with-creator nil          ;; EmacsとOrg version表記除外
             :with-toc nil                ;; Table of Contents出力
             :section-numbers nil       ;; ナンバリング禁止
             :time-stamp-file nil       ;; タイムスタンプを除外
             )))

;; (require 'org-roam-export)
#+end_src

html用.

#+begin_src emacs-lisp :tangle no
(setq org-publish-project-alist
      (list
       (list "keido-org"
             :recursive nil
             :base-directory org-roam-zk-dir
             :publishing-directory "~/repo/keido-org/public/notes"
             :exclude ".*gitignore|.*/private/.*" 
             ;; :auto-sitemap t
             ;; :sitemap-function 'roam-sitemap
             ;; :sitemap-title "Keido notes"
             :publishing-function 'org-html-publish-to-html
             :with-author nil           ;; 作成者除外
             :with-creator nil          ;; EmacsとOrg version表記除外
             :with-toc t                ;; Table of Contents出力
             :section-numbers nil       ;; ナンバリング禁止
             :time-stamp-file nil       ;; タイムスタンプを除外
             )))

(defun my/setup-org-theme (backend)
  (goto-char (point-max))
  (insert "\n#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup\n")
  (insert "\n#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>\n"))

(defun my/collect-backlinks-string (backend)
  "Insert backlinks into the end of the org file before parsing it."
  (when (org-roam-node-at-point)
    (goto-char (point-max))
    ;; Add a new header for the references
    (insert "\n\n* 🔗Backlinks\n")
    (let* ((backlinks (org-roam-backlinks-get (org-roam-node-at-point))))
      (dolist (backlink backlinks)
        (let* ((source-node (org-roam-backlink-source-node backlink))
               (node-file (org-roam-node-file source-node))
               (file-name (file-name-nondirectory node-file))
               (title (org-roam-node-title source-node)))
          (insert
           (format "- [[./%s][%s]]\n" file-name title)))))))

(add-hook 'org-export-before-parsing-functions 'my/setup-org-theme)
(add-hook 'org-export-before-processing-functions 'my/collect-backlinks-string)

;; (require 'org-roam-export)
#+end_src

*** org-roam-dailies

Org-roamに組み込まれた劣化版org-journal. 現状使用するのをやめた.

org-roam-dialiesよりもorg-journalを利用する(org-agendaの都合).

ref. [[https://org-roam.discourse.group/t/org-journal-vs-org-roam-dailies/384][Org-journal vs org-roam-dailies - Troubleshooting - Org-roam]]

週単位で日記のようなページを外部公開用に使う.

ツイッターのようなマイクロブログの利用を想定している.

#+begin_src emacs-lisp :tangle yes
(after! org-roam
  (setq org-roam-dailies-directory "zk")

  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry "** %?" :if-new
           (file+head+olp "%<%G-w%V>.org" "#+title: 📓%<%G-w%V>\n"
                          ("🖊Journals"))))))
#+end_src

#+begin_src emacs-lisp :tangle yes
(after! org-capture
  (add-to-list 'org-capture-templates
        '("w" "💭 Thought(weekly)" entry
          (file+headline (lambda ()
                     (my/create-weekly-org-file my/weekly-journal-dir))
                         "🖊Journals")
              "* 💭%?\n%T\n\n" 
              :empty-lines 1 
              :unnarrowed nil ;; ほかのエントリは見えないように.
              :klll-buffer t)))
#+end_src

