nothung.el
  (setq org-roam-directory (file-truename "~/repo/keido/notes"))
  (setq org-roam-zk-dir (concat org-roam-directory "/zk"))
  (setq org-roam-db-location (file-truename "~/repo/keido/db/org-roam.db"))

  (use-package! org-roam
    :after org
    :init
    (setq org-roam-v2-ack t)
    (map!
          :leader
          :prefix ("r" . "org-roam")
          "f" #'org-roam-node-find
          "i" #'org-roam-node-insert
          "l" #'org-roam-buffer-toggle
          "t" #'org-roam-tag-add
          "T" #'org-roam-tag-remove
          "a" #'org-roam-alias-add
          "A" #'org-roam-alias-remove
          "r" #'org-roam-ref-add
          "R" #'org-roam-ref-remove
          "o" #'org-id-get-create
          "u" #'my/org-roam-update
          "D" #'org-roam-dailies-goto-today
          )
    :custom
    ;;ファイル名を ID にする.
    (org-roam-capture-templates
     '(("z" "🌱 Zettel" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "\n#+date: %T\n#+title:🌱${title}\n#+filetags: :ZETTEL:\n")
        :unnarrowed t)
       ("w" "📝 Wiki" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:📝${title}\n#+filetags: :WIKI:\n")
        :unnarrowed t)
       ("t" "🔖 Tag" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:🔖${title}\n#+filetags: :TAG:\n")
        :unnarrowed t)
       ("h" "👨 Person" plain "%?"
        :target (file+head
                 "zk/%<%Y%m%d%H%M%S>.org"
                 "#+title:👨${title}\n#+filetags: :PERSON:\n")
        :unnarrowed t)
       ("f" "📂 Type" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:📂${title}\n#+filetags: :TYPE:\n")
        :unnarrowed t)
       ("m" "🌳 MOC" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:🌳${title}\n#+filetags: :MOC:\n")
        :unnarrowed t)
       ("i" "✅ Issue" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                          "#+title:✅${title}\n#+filetags: :ISSUE:\n")
        :unnarrowed t)
       ("d" "💡 Idea" plain "%?"
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:💡${title}\n#+filetags: :IDEA:\n")
        :unnarrowed t)
       ("c" "📑 Concept" plain "%?"
        :target (file+head
                 "zk/%<%Y%m%d%H%M%S>.org"
                 "#+title:🎓${title}\n#+filetags: :CONCEPT:\n")
        :unnarrowed t)
       ("k" "🦊 Darkfox" plain "%?"
        :target (file+head
                 "zk/%<%Y%m%d%H%M%S>.org"
                 "#+title:🦊${title}\n#+filetags: :DARKFOX:\n")
        :unnarrowed t)
       ("b" "📚 Book" plain
        "%?

  - title: %^{title}
  - authors: %^{author}
  - date: %^{date}
  - publisher: %^{publisher}
  - url: http://www.amazon.co.jp/dp/%^{isbn}
  "
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:📚${title} - ${author}(${date})\n#+filetags: :BOOK:SOURCE:\n")
        :unnarrowed t)
       ("s" "🎙‍ Talk" plain
        "%?

  - title: %^{title}
  - url: %^{url}
  "
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:🎙 ${title} - ${editor}(${date})\n#+filetags: :TALK:SOURCE:\n")
        :unnarrowed t)
       ("o" "💻 Online" plain
        "%?

  - title: %^{title}
  - authors: %^{author}
  - url: %^{url}
  "
        :target (file+head "zk/%<%Y%m%d%H%M%S>.org"
                           "#+title:💻${title}\n#+filetags: :ONLINE:SOURCE:\n")
        :unnarrowed t)))
    (org-roam-extract-new-file-path "%<%Y%m%d%H%M%S>.org")
    ;;        :map org-mode-map
    ;;        ("C-M-i"    . completion-at-point)
    :config
    (defun my/org-roam-update ()
      (interactive)
      (org-id-update-id-locations)
      (org-roam-db-sync)
      (org-roam-update-org-id-locations))

    (setq org-roam-mode-sections
          '((org-roam-backlinks-section :unique t)))

    (setq org-roam-db-gc-threshold most-positive-fixnum)

    ;; for speed up
    ;; (setq org-roam-node-default-sort 'file-mtime)

    (setq +org-roam-open-buffer-on-find-file nil)
    ;; (org-roam-db-autosync-mode)
    (org-roam-db-autosync-enable)

    ;; (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))

    ;; for emacs 29~
    ;; (when (>= emacs-major-version 29)
    ;; (setq org-roam-database-connector 'sqlite-builtin))
  )

(setq org-roam-db-node-include-function
      (lambda ()
        (not (member "" (org-get-tags)))))

(use-package! consult-org-roam
   :init
   (require 'consult-org-roam)
   ;; Activate the minor-mode
   (consult-org-roam-mode 1)
   :custom
   (consult-org-roam-grep-func #'consult-ripgrep)
   :config
   ;; Eventually suppress previewing for certain functions
   (consult-customize
    consult-org-roam-forward-links
    :preview-key (kbd "M-."))
   :bind
   ("C-c r F" . consult-org-roam-file-find)
   ("C-c r b" . consult-org-roam-backlinks)
   ("C-c r S" . consult-org-roam-search))

(defun my/org-roam-rg-search ()
  "Search org-roam directory using consult-ripgrep. With live-preview."
  (interactive)
  (consult-ripgrep org-roam-directory))
(global-set-key (kbd "C-c r s") 'my/org-roam-rg-search)

(after! org-roam
  (setq org-roam-dailies-directory "zk")

  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry "** %?" :if-new
           (file+head+olp "%<%G-w%V>.org" "#+title: 📓%<%G-w%V>\n"
                          ("🖊Journals"))))))

(after! org-capture
  (add-to-list 'org-capture-templates
        '("w" "💭 Thought(weekly)" entry
          (file+headline (lambda ()
                     (my/create-weekly-org-file my/weekly-journal-dir))
                         "🖊Journals")
              "* 💭%?\n%T\n\n" 
              :empty-lines 1 
              :unnarrowed nil ;; ほかのエントリは見えないように.
              :klll-buffer t)))
