nothung.org
*** org-roam-ui(disabled)

Web UI.

#+begin_src emacs-lisp :tangle no
(use-package! websocket
    :after org-roam)
(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
    ;; :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))


#+end_src

*** org-roam-timestamps(disabled)

org-roam-uiでつかうメタ情報を付与することが目的だが現状使っていないのでいったん封印.

#+begin_src emacs-lisp :tangle no
(use-package! org-roam-timestamps
   :after org-roam
   :config
   (org-roam-timestamps-mode)
   (setq org-roam-timestamps-remember-timestamps nil)
   (setq org-roam-timestamps-remember-timestamps nil))
#+end_src

*** org-roamのslowdownを回避するTip

https://www.reddit.com/r/orgmode/comments/s8xv5j/orgroam_slows_down_as_nodes_increase_solution/

#+begin_src emacs-lisp :tangle yes
;; 2. Memoize the function that costs the most.
(load-file "~/.doom.d/private/memoize.el")
(require 'memoize)

(memoize 'org-roam-node-read--completions "10 minute")

(defun memoize-force-update (func &optional timeout)
  (when (get func :memoize-original-function)
    (progn (memoize-restore func)
           (memoize func timeout))))
(defun my/force-update-org-roam-node-read-if-memoized (&optional timeout)
  (interactive)
  (memoize-force-update 'org-roam-node-read--completions
                        (if timeout timeout memoize-default-timeout)))
(run-with-idle-timer 60 t #'my/force-update-org-roam-node-read-if-memoized)
;; Note: it might be better to hack org-roam to make it use
;; hash-tables instead of lists. Have a way to quickly detect
;; which node is to be updated.
#+end_src


** org-toggl

org-modeをTogglと連携させる.
https://github.com/mbork/org-toggl

#+begin_src emacs-lisp :tangle no
(use-package! org-toggl
  :after org
  :config
  (setq org-toggl-inherit-toggl-properties t)
  (toggl-get-projects)
  (setq toggl-default-project "GTD")
  (org-toggl-integration-mode))
#+end_src

** org-journal

https://github.com/bastibe/org-journal

#+begin_src emacs-lisp :tangle yes
(use-package! org-journal
  :after org
  :bind
  ;; org-roamと揃えたいので C-c rまでをprefixにする.
  ("C-c r d n" . org-journal-new-entry)
  ("C-c r d d" . org-journal-open-current-journal-file)
  :config
  (setq org-journal-date-prefix "#+TITLE: ✍")
  ;; (setq org-journal-file-type `daily)
  ;; (setq org-journal-file-format "%Y-%m-%d.org")
  ;; (setq org-journal-date-format "%Y-%m-%d")
  ;; これはorg-journalの変数ではない.
  (setq org-journal-file-format "%Y-w%V.org")
  (setq org-journal-date-format "%Y-w%V")
  (setq org-journal-file-type `weekly)
  (setq org-journal-dir my/weekly-private-dir)
  ;; (setq org-journal-enable-agenda-integration t)
)
#+end_src

** org-ref(bibtex)

文献管理. Zoteroと連携して，論文というよりは書籍やYoutube動画やWeb記事のメモに利用.

- org-ref
- ivy-bibtex
  - ivyのactionは ivy-bibtexでC-SPCで選択-> C-M-oでaction選択候補を出し，pとかeとか押す.
- org-roam-bibtex

なんかzoteroからデータエクスポートできなくなって動かなくなった.

なんかorg-mode開くたびにreloadが走るのでmaskした.

#+begin_src emacs-lisp :tangle no
(use-package! org-ref
  :config
  (setq bibtex-completion-bibliography (list (file-truename "~/repo/keido/references/zotLib.bib")))

  (setq bibtex-completion-additional-search-fields '(keywords))
  (setq bibtex-completion-display-formats
    '((online       . "${=has-pdf=:1}${=has-note=:1} ${=type=:6} ${year:4} ${author:24} ${title:*}")
      (book         . "${=has-pdf=:1}${=has-note=:1} ${=type=:6} ${year:4} ${author:24} ${title:*}")
      (video        . "${=has-pdf=:1}${=has-note=:1} ${=type=:6} ${year:4} ${editor:24} ${title:*}")
      (paper        . "${=has-pdf=:1}${=has-note=:1} ${=type=:6} ${year:4} ${author:24} ${title:*}")
      (t            . "${=has-pdf=:1}${=has-note=:1} ${=type=:6} ${year:4} ${author:24} ${title:*}")))
  (setq bibtex-completion-pdf-symbol "📓")
  (setq bibtex-completion-notes-symbol "📝")

  (setq bibtex-completion-pdf-field "file")
  ;; (setq bibtex-completion-pdf-open-function
  ;;	(lambda (fpath)
  ;;	  (call-process "open" nil 0 nil fpath)))

  ;; Create fields for Film type
  (add-to-list 'bibtex-biblatex-field-alist
               '(("video" "Video or Audio(like YouTube)")))

  (add-to-list 'bibtex-biblatex-entry-alist
               '("video" "A Video"
                 ("video", "title" "editor" "date" "url" "urldate" "abstract" "editortype")
                 nil
                 "keywords"))
  (bibtex-set-dialect 'biblatex))

(use-package! ivy-bibtex
  :after org-ref
  :init
  (map!
   :leader
   :prefix ("b" . "org-ref")
     "b" #'org-ref-bibtex-hydra/body
     "v" #'ivy-bibtex
     "c" #'org-ref-insert-cite-link
     "a" #'orb-note-actions
     "i" #'orb-insert-link)
  :config
  (setq ivy-re-builders-alist
        '((ivy-bibtex . ivy--regex-ignore-order)
          (t . ivy--regex-plus)))
  (setq ivy-bibtex-default-action #'ivy-bibtex-open-url-or-doi)
  (ivy-set-actions
   'ivy-bibtex
   '(("p" ivy-bibtex-open-any "Open PDF, URL, or DOI" ivy-bibtex-open-any)
     ("e" ivy-bibtex-edit-notes "Edit notes" ivy-bibtex-edit-notes)))
  )

(use-package! org-roam-protocol
  :after org-protocol)
#+end_src

つかってないのでエラーたのでいったんマスク.

#+begin_src emacs-lisp :tangle no
(use-package! org-roam-bibtex
  :after org-roam ivy-bibtex
  :hook (org-mode . org-roam-bibtex-mode)
  :custom
  (orb-insert-interface 'ivy-bibtex)
  :config
    (setq orb-preformat-keywords '("author" "date" "url" "title" "isbn" "publisher" "urldate" "editor" "file"))
    (setq orb-process-file-keyword t)
    (setq orb-attached-file-extensions '("pdf")))
#+end_src

** org-anki

Org-modeとAnkiをつなぐ.

https://github.com/eyeinsky/org-anki

今までanki-editorを利用していたものの，その記法とwikiの相性が悪かった（冗長）. これならorg-modeのheadlineがそのままつかえるのでよさそう.

#+begin_src emacs-lisp :tangle yes
(use-package! org-anki
  :after org
  :custom
  ;; one big deckの原則に従う.
  ;; ref: http://augmentingcognition.com/ltm.html
  (org-anki-default-deck "Default")
  :config
  (define-key org-mode-map (kbd "C-c n A s") #'org-anki-sync-entry)
  (define-key org-mode-map (kbd "C-c n A u") #'org-anki-update-all)
  (define-key org-mode-map (kbd "C-c n A d") #'org-anki-delete-entry))
#+end_src

URLの挿入はorg-link形式でできる. これは便利.
** org-bars(deprecated)

今どきのアウトライナー的な線を出す.

- Terminal Mode ではつかえない.
- リストの折返しでのインデントは崩れる.

#+begin_src emacs-lisp :tangle no
(require 'org-bars)
(add-hook! 'org-mode-hook #'org-bars-mode)
#+end_src

<2025-11-12 Wed 16:25> 表示が気持ち悪くなったので無効化.

** Org-noter(disabled)

PDFの注釈を管理する. [[https://github.com/weirdNox/org-noter][:link:weirdNox/org-noter]]

はじめの起動がどうやればいいのかワカラなかった. 特定のファイルに記録を残したい場合はPDFのBufferではなく, 適当なheading作成してM-x org-noterを起動するとPDFを選択できる.

M-x org-noter-create-skeltonという関数がヤばい. [[https://youtu.be/lCc3UoQku-E?t=68][🔗Youtube動画(1:08)]] PDFからOutlineを抜き出してOrg fileに生成して，あとはそのOrg-fileのBulletのカーソルを移動するとPDFのほうもシンクロして移動できる. 

凄すぎて笑った😂

#+begin_src emacs-lisp :tangle no
(use-package! org-noter
  :after (:any org pdf-view)
  :config
  (setq
   ;; I want to see the whole file
   org-noter-hide-other nil
   ;; Everything is relative to the main notes file
   org-noter-notes-search-path (list (file-truename "~/repo/keido/notes/wiki"))))
#+end_src

** org-trello(disabled)

Kanbanツール Trello連携. 

- refs.
  - [[http://org-trello.github.io/][org-trello(official)]]
  - [[https://github.com/org-trello/org-trello][GitHub - org-trello/org-trello]]

古いプロジェクトだがメンテもされていてスターも500以上ついている.

ただし動かない...native comp無効で行けるか. -> いけた.
https://github.com/org-trello/org-trello/issues/418

#+begin_src emacs-lisp :tangle no
(use-package! org-trello)
#+end_src

どうもDoom Emacsだと C-uが効かない. そしてそれによってtrello->org-fileへのdownloadがC-u C-c o sに頼っているので不便になる. *(org-trello-sync-buffer t)* を評価するとダウンロードが走るという仕様のためこれを関数にして呼ぶことによって代替.

[[https://github.com/org-trello/org-trello/issues/409][Synching from and to Trello does not work · Issue #409]]

#+begin_src emacs-lisp :tangle no
(after! org-trello
  (defun my/org-trello-sync-from-trello ()
    (interactive)
    (org-trello-sync-buffer t)))
#+end_src

** org-table

#+begin_src emacs-lisp :tangle yes
(setq org-table-export-default-format "orgtbl-to-csv")
#+end_src

** org-sidebar

https://github.com/alphapapa/org-sidebar

org-sidebar-treeでサイドバーにアウトラインを表示.

#+begin_src emacs-lisp :tangle no
(use-package! org-sidebar
  :config
  ;; cider-modeに合わせて C-c C-zにbindしてみた.
  (define-key org-mode-map (kbd "C-c C-z") #'org-sidebar-tree-toggle))
#+end_src

** Org timestamps

org-mode で timestamp のみを挿入するカスタム関数. Doom EmacsのせいでC-u C-c .が動作しないので.

#+begin_src emacs-lisp :tangle yes
(after! org
  (defun my/insert-timestamp ()
    (interactive)
    (org-insert-time-stamp (current-time) t))
  (defun my/insert-timestamp-inactive ()
    (interactive)
    (org-time-stamp-inactive (current-time)))
  (map! :map org-mode-map "C-u C-c C-." #'my/insert-timestamp-inactive)
  (map! :map org-mode-map "C-c C-." #'my/insert-timestamp))
#+end_src

---

空白が保存時に削除されると bullet 表示がおかしくなる.
なお wl-bulter は doom emacs のデフォルトで組み込まれている.

#+begin_src emacs-lisp :tangle yes
(add-hook! 'org-mode-hook
  (when (fboundp 'ws-butler-mode)
    (ws-butler-mode -1)))
#+end_src

** org-pomodoro

#+begin_src emacs-lisp :tangle no
(use-package! org-pomodoro)
#+end_src

** org-web-tools

ewwとorgを便利にするツール群(https://github.com/alphapapa/org-web-tools).

#+begin_src emacs-lisp :tangle yes
(use-package! org-web-tools
  :bind
  ("C-c i l" . org-web-tools-insert-link-for-url))
#+end_src


** org-ai

https://github.com/rksm/org-ai

openai-api-tokenの設定が必要. private/config.elで定義している.

#+begin_src emacs-lisp :tangle yes
(use-package! org-ai
  :load-path (lambda () "~/.emacs.d/.local/straight/repos/org-ai")
  :commands (org-ai-mode)
  ;; :custom
  ;; (org-ai-openai-api-token "")
  :init
  (add-hook 'org-mode-hook #'org-ai-mode)
  :config
  ;; if you are using yasnippet and want `ai` snippets
  (org-ai-install-yasnippets))
#+end_src

* Term
#+begin_src emacs-lisp :tangle yes
;; Term
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
 (after! vterm                                                                               (add-hook 'vterm-mode-hook #'hl-line-mode))
#+end_src

* Tools
#+begin_src emacs-lisp :tangle yes
;; Tools
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+end_src

** forge

magit拡張, EmacsとGitHubを連携.

doom emacsだと [[https://github.com/hlissner/doom-emacs/blob/develop/modules/tools/magit/README.org][(magit +forge)]] のオプションでインストールできる.

ref: [[https://magit.vc/manual/forge/][Forge User and Developer Manual]]

#+begin_src emacs-lisp :tangle yes
(after! magit
  (setq auth-sources '("~/.authinfo"))
  (setq magit-revision-show-gravatars '("^Author:     " . "^Commit:     "))
  ;; (setq magit-diff-refine-hunk 'all)
)
#+end_src

リポジトリ名を変更した場合はissueやPRの作成が失敗する.
これは .git/configの問題なのでローカルのファイルを修正する.

** git-link

現在のバッファの位置のGitHubのurlを取得.

[[https://github.com/sshaw/git-link][sshaw/git-link]]

#+begin_src emacs-lisp :tangle yes
(global-set-key (kbd "C-c s g") 'git-link)
(use-package! git-link
  :config
  ;; urlにbranchではなくcommit番号をつかう.
  ;; org-journalへの貼り付けを想定しているのでこの設定にしておく.
  (setq git-link-use-commit t))
#+end_src

* UI

みため周りの設定.

