nothung.el

;; 2. Memoize the function that costs the most.
(load-file "~/.doom.d/private/memoize.el")
(require 'memoize)

(memoize 'org-roam-node-read--completions "10 minute")

(defun memoize-force-update (func &optional timeout)
  (when (get func :memoize-original-function)
    (progn (memoize-restore func)
           (memoize func timeout))))
(defun my/force-update-org-roam-node-read-if-memoized (&optional timeout)
  (interactive)
  (memoize-force-update 'org-roam-node-read--completions
                        (if timeout timeout memoize-default-timeout)))
(run-with-idle-timer 60 t #'my/force-update-org-roam-node-read-if-memoized)
;; Note: it might be better to hack org-roam to make it use
;; hash-tables instead of lists. Have a way to quickly detect
;; which node is to be updated.

(use-package! org-journal
  :after org
  :bind
  ;; org-roamと揃えたいので C-c rまでをprefixにする.
  ("C-c r d n" . org-journal-new-entry)
  ("C-c r d d" . org-journal-open-current-journal-file)
  :config
  (setq org-journal-date-prefix "#+TITLE: ✍")
  ;; (setq org-journal-file-type `daily)
  ;; (setq org-journal-file-format "%Y-%m-%d.org")
  ;; (setq org-journal-date-format "%Y-%m-%d")
  ;; これはorg-journalの変数ではない.
  (setq org-journal-file-format "%Y-w%V.org")
  (setq org-journal-date-format "%Y-w%V")
  (setq org-journal-file-type `weekly)
  (setq org-journal-dir my/weekly-private-dir)
  ;; (setq org-journal-enable-agenda-integration t)
)

(use-package! org-anki
  :after org
  :custom
  ;; one big deckの原則に従う.
  ;; ref: http://augmentingcognition.com/ltm.html
  (org-anki-default-deck "Default")
  :config
  (define-key org-mode-map (kbd "C-c n A s") #'org-anki-sync-entry)
  (define-key org-mode-map (kbd "C-c n A u") #'org-anki-update-all)
  (define-key org-mode-map (kbd "C-c n A d") #'org-anki-delete-entry))

(setq org-table-export-default-format "orgtbl-to-csv")

(after! org
  (defun my/insert-timestamp ()
    (interactive)
    (org-insert-time-stamp (current-time) t))
  (defun my/insert-timestamp-inactive ()
    (interactive)
    (org-time-stamp-inactive (current-time)))
  (map! :map org-mode-map "C-u C-c C-." #'my/insert-timestamp-inactive)
  (map! :map org-mode-map "C-c C-." #'my/insert-timestamp))

(add-hook! 'org-mode-hook
  (when (fboundp 'ws-butler-mode)
    (ws-butler-mode -1)))

(use-package! org-web-tools
  :bind
  ("C-c i l" . org-web-tools-insert-link-for-url))

(use-package! org-ai
  :load-path (lambda () "~/.emacs.d/.local/straight/repos/org-ai")
  :commands (org-ai-mode)
  ;; :custom
  ;; (org-ai-openai-api-token "")
  :init
  (add-hook 'org-mode-hook #'org-ai-mode)
  :config
  ;; if you are using yasnippet and want `ai` snippets
  (org-ai-install-yasnippets))

;; Term
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
 (after! vterm                                                                               (add-hook 'vterm-mode-hook #'hl-line-mode))

;; Tools
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(after! magit
  (setq auth-sources '("~/.authinfo"))
  (setq magit-revision-show-gravatars '("^Author:     " . "^Commit:     "))
  ;; (setq magit-diff-refine-hunk 'all)
)

(global-set-key (kbd "C-c s g") 'git-link)
(use-package! git-link
  :config
  ;; urlにbranchではなくcommit番号をつかう.
  ;; org-journalへの貼り付けを想定しているのでこの設定にしておく.
  (setq git-link-use-commit t))

;; UI
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
